app/Controllers/UserController.php

                    ];

                    $save = new UserModel();
                    if ($save->insert($data)) {
---
INSERT INTO `users` (`name`, `age`, `city`, `created_at`, `updated_at`) VALUES ('MOCHAMAD RIZAL FACHRUDIN', '22', 'MALANG', '2023-07-18 05:40:31', '2023-07-18 05:40:31')

    public function list()
    {
        $userModel = new UserModel();
        $data = [
            'title' => 'Daftar User',
            'users' => $userModel->findAll(),
---
SELECT *
FROM `users`